<template>
  <div class="privacy-container text-black">
    <h1 class="text-center text-xl">Privacy Policy</h1>
    <h2 class="text-lg">ประเภทข้อมูลส่วนบุคคลที่คลินิกเก็บรวบรวม</h2>
    <ul>
      <li>ข้อมูลการติดต่อ</li>
      <li>ข้อมูลการเข้าใช้เว็บไซต์</li>
      <li>ข้อมูลสุขภาพ</li>
      <li>รูปภาพหรือวิดีโอที่เห็นใบหน้า</li>
      <li>ความพึงพอใจ ข้อเสนอแนะ</li>
      <li>การชำระค่าบริการ สิทธิการรักษา การประกันสุขภาพ</li>
    </ul>
    <h2 class="text-lg">วัตถุประสงค์ในการเก็บรวบรวม</h2>
    <ul class="">
      <li>เพื่อให้บริการด้านสุขภาพ การป้องกันหรือระงับอันตรายต่อชีวิต</li>
      <li>เพื่อประโยชน์ด้านการศึกษา โดยจัดให้มีมาตาการคุ้มครองที่ <br> เหมาะสม</li>
      <li>เพื่อรักษาความปลอดภัยต่อชีวิตและทรัพย์สินของบุคคลหรือนิติบุคคล</li>
      <li>
        วัตถุประสงค์อื่นๆ นอกจากที่กฎหมายกำหนดต้องขอความยินยอมเจ้าของข้อมูลก่อน
      </li>
    </ul>
    <h2 class="text-lg">คลินิกเปิดเผยข้อมูลส่วนบุคคลต่อบุคคลหรือหน่วยงานต่อไปนี้</h2>
    <p class="indent-5">คลินิกจะดำเนินการภายใต้ข้อกำหนดของกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล และป้องกันมิให้มีการใช้หรือเปิดเผยข้อมูลส่วนบุคคลโดยมิชอบในการเปิดเผยข้อมูลแก่บุคคลและหน่วยงานดังต่อไปนี้</p>
    <ul class="">
      <li>บุคลากรของคลินิก ผู้ประกอบวิชาชีพอื่นๆ เพื่อปรึกษาหรือส่งผลต่อการรักษาฯ</li>
      <li>สมาชิกครอบครัวผู้รับบริการ ญาติ ผู้ดูแล หรือบุคคลอื่นที่เกี่ยวข้องกับผู้รับบริการ</li>
      <li>การแลกเปลี่ยนข้อมูลกับสถาบันการศึกษา</li>
      <li>
        ที่ปรึกษาทางกฎหมาย ผู้ตรวจสอบของหน่วยงาน เพื่อการพัฒนาการให้บริการฯ
      </li>
      <li>
        หน่วยงานอื่นๆ เพื่อปฏิบัติหน้าที่ตามกฎหมายบัญญัติให้ต้องเปิดเผย
      </li>
    </ul>
  </div>
</template>

<script setup></script>

<style>
.privacy-container {
  padding: 5px;
}

.privacy-container ul {
  list-style-type: decimal;
  padding-left: 30px;
  text-indent: 2px;
}
</style>
